{
  "_name_or_path": "microsoft/layoutlmv3-base",
  "architectures": [
    "LayoutLMv3ForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "coordinate_size": 128,
  "eos_token_id": 2,
  "has_relative_attention_bias": true,
  "has_spatial_attention_bias": true,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-ABN",
    "2": "B-BILLER",
    "3": "B-BILLER_ADDRESS",
    "4": "B-BILLER_POST_CODE",
    "5": "B-DUE_DATE",
    "6": "B-GST",
    "7": "B-INVOICE_DATE",
    "8": "B-INVOICE_NUMBER",
    "9": "B-SUBTOTAL",
    "10": "B-TOTAL",
    "11": "I-BILLER_ADDRESS"
  },
  "initializer_range": 0.02,
  "input_size": 224,
  "intermediate_size": 3072,
  "label2id": {
    "B-ABN": 1,
    "B-BILLER": 2,
    "B-BILLER_ADDRESS": 3,
    "B-BILLER_POST_CODE": 4,
    "B-DUE_DATE": 5,
    "B-GST": 6,
    "B-INVOICE_DATE": 7,
    "B-INVOICE_NUMBER": 8,
    "B-SUBTOTAL": 9,
    "B-TOTAL": 10,
    "I-BILLER_ADDRESS": 11,
    "O": 0
  },
  "layer_norm_eps": 1e-05,
  "max_2d_position_embeddings": 1024,
  "max_position_embeddings": 514,
  "max_rel_2d_pos": 256,
  "max_rel_pos": 128,
  "model_type": "layoutlmv3",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "patch_size": 16,
  "rel_2d_pos_bins": 64,
  "rel_pos_bins": 32,
  "second_input_size": 112,
  "shape_size": 128,
  "text_embed": true,
  "torch_dtype": "float32",
  "transformers_version": "4.20.0.dev0",
  "type_vocab_size": 1,
  "visual_embed": true,
  "vocab_size": 50265
}
